
/*===================================================================*/
/*  审批表增加发起流程描述字段     */
/*===================================================================*/
ALTER TABLE FlowInstance add COLUMN  `Description`       text comment '发起流程备注';

/*===================================================================*/
/*  修改预算单状态为0的数据      */
/*===================================================================*/
UPDATE  Budget SET `State`=1 WHERE `State`=0;
UPDATE  Budget SET Validity=NULL WHERE `Validity`='0001-01-01 00:00:00';

